SQL/W3D3/URLShortener/app/models/shortened_url.rb

  def self.random_code
    rand_str = ""
    loop do
      rand_str = SecureRandom.urlsafe_base64
      break unless ShortenedUrl.exists?(short_url: rand_str)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "aksVpfu5HaZ2PuxzvBt5VA"], ["LIMIT", 1]]

  def self.create!(user, long_url)
---
INSERT INTO "shortened_urls" ("long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_url", "http://www.google.com"], ["user_id", 1], ["created_at", "2018-12-21 04:25:22.831954"], ["updated_at", "2018-12-21 04:25:22.831954"]]